using EfApp.Models;
using System;
using System.Text;

namespace EfApp.Views
{
    public class UserAndBookInfoView
    {
        public static void Info()
        {
            //Получать список книг определенного жанра и вышедших между определенными годами.
            //Получать количество книг определенного автора в библиотеке.
            //Получать количество книг определенного жанра в библиотеке.
            //Получать булевый флаг о том, есть ли книга определенного автора и с определенным названием в библиотеке.
            //Получать булевый флаг о том, есть ли определенная книга на руках у пользователя.
            //Получать количество книг на руках у пользователя.
            //Получение последней вышедшей книги.
            //Получение списка всех книг, отсортированного в алфавитном порядке по названию.
            //Получение списка всех книг, отсортированного в порядке убывания года их выхода.
        }
    }
}